zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/dmic_reg.h
/**************************************************************************//**
 * @file     dmic_reg.h
 * @version  V1.00
 * @brief    DMIC register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __DMIC_REG_H__
#define __DMIC_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup DMIC Digital Microphone Inputs (DMIC)
    Memory Mapped Structure for DMIC Controller
    @{
*/

typedef struct
{

    /**
     * @var DMIC_T::CTL
     * Offset: 0x00  DMIC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CHEN0     |DMIC Channel 0 Enable
     * |        |          |Set this bit to 1 to enable DMIC channel 0 operation.
     * |        |          |0 = DMIC Channel 0 Disabled.
     * |        |          |1 = DMIC Channel 0 Enabled.
     * |[1]     |CHEN1     |DMIC Channel 1 Enable
     * |        |          |Set this bit to 1 to enable DMIC channel 1 operation.
     * |        |          |0 = DMIC Channel 1 Disabled.
     * |        |          |1 = DMIC Channel 1 Enabled.
     * |[2]     |CHEN2     |DMIC Channel 2 Enable
     * |        |          |Set this bit to 1 to enable DMIC channel 2 operation.
     * |        |          |0 = DMIC Channel 2 Disabled.
     * |        |          |1 = DMIC Channel 2 Enabled.
     * |[3]     |CHEN3     |DMIC Channel 3 Enable
     * |        |          |Set this bit to 1 to enable DMIC channel 3 operation.
     * |        |          |0 = DMIC Channel 3 Disabled.
     * |        |          |1 = DMIC Channel 3 Enabled.
     * |[8]     |LCHEDGE01 |DMIC Channel 01 Data Latch Edge
     * |        |          |The data of DMIC channel 0 and channel 1 is latched on DMIC_DATA0 pin
     * |        |          |This bit is used to select the data of DMIC channel 0 and channel 1 is latched on rising or falling edge of DMIC_CLK (DMIC bus clock).
     * |        |          |0 = The data of channel 0 is latched on falling edge of DMIC_CLK
     * |        |          |The data of channel 1 is latched on rising edge of DMIC_CLK.
     * |        |          |1 = The data of channel 0 is latched on rising edge of DMIC_CLK
     * |        |          |The data of channel 1 is latched on falling edge of DMIC_CLK.
     * |[9]     |LCHEDGE23 |DMIC Channel 23 Data Latch Edge
     * |        |          |The data of DMIC channel 2 and channel 3 is latched on DMIC_DATA0 pin
     * |        |          |This bit is used to select the data of DMIC channel 2 and channel 3 is latched on rising or falling edge of DMIC_CLK (DMIC bus clock).
     * |        |          |0 = The data of channel 2 is latched on falling edge of DMIC_CLK
     * |        |          |The data of channel 3 is latched on rising edge of DMIC_CLK.
     * |        |          |1 = The data of channel 2 is latched on rising edge of DMIC_CLK
     * |        |          |The data of channel 3 is latched on falling edge of DMIC_CLK.
     * |[12]    |CH0MUTE   |DMIC Channel 0 Mute Enable
     * |        |          |Set this bit to 1 to mute DMIC channel 0.
     * |        |          |0 = DMIC Channel 0 Unmute.
     * |        |          |1 = DMIC Channel 0 Mute.
     * |[13]    |CH1MUTE   |DMIC Channel 1 Mute Enable
     * |        |          |Set this bit to 1 to mute DMIC channel 1.
     * |        |          |0 = DMIC Channel 1 Unmute.
     * |        |          |1 = DMIC Channel 1 Mute.
     * |[14]    |CH2MUTE   |DMIC Channel 2 Mute Enable
     * |        |          |Set this bit to 1 to mute DMIC channel 2.
     * |        |          |0 = DMIC Channel 2 Unmute.
     * |        |          |1 = DMIC Channel 2 Mute.
     * |[15]    |CH3MUTE   |DMIC Channel 3 Mute Enable
     * |        |          |Set this bit to 1 to mute DMIC channel 3.
     * |        |          |0 = DMIC Channel 3 Unmute.
     * |        |          |1 = DMIC Channel 3 Mute.
     * |[20]    |CH01HPFEN |DMIC Channel 01 HPF filter Enable.
     * |        |          |Set this bit to 1 to Enable DMIC channel 0 and channel 1 HPF filter for remove DC component.
     * |        |          |0 = DMIC Channel 01 HPF Disabled.
     * |        |          |1 = DMIC Channel 01 HPF Enabled.
     * |[21]    |CH23HPFEN |DMIC Channel 23 HPF filter Enable.
     * |        |          |Set this bit to 1 to Enable DMIC channel 2 and channel 3 HPF filter for remove DC component.
     * |        |          |0 = DMIC Channel 23 HPF Disabled.
     * |        |          |1 = DMIC Channel 23 HPF Enabled.
     * |[24]    |SWRST     |Internal State Software Reset.
     * |        |          |Set this bit to 1 to Clear DMIC internal state, but all DMIC registers are kept unchanged.
     * |        |          |0 = Normal operation
     * |        |          |1 = Internal DMIC State Reset
     * |[28:27] |GAINSTEP  |Volume Control Gain Adjust Step for Decimal Point.
     * |        |          |00 = 0.5dB (1/2)
     * |        |          |01 = 0.25dB (1/4)
     * |        |          |10 = 0.125dB (1/8)
     * |        |          |11 = 0.0625dB (1/16)
     * |[31]    |FIFOWIDTH |Data Effective Bit in FIFO
     * |        |          |0 = 16-bit, Data Truncated LSB bit0~bit7. [15:0]
     * |        |          |1 = 24-bit
     * @var DMIC_T::DIV
     * Offset: 0x04  DMIC Clock Divider Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[13:8]  |DMCLKDIV  |Divider to generate the DMIC Bus Clock
     * |        |          |The value in this field is the frequency divider for generating the DMIC bus clock
     * |        |          |The frequency is obtained according to the following equation.
     * |        |          |F_DMIC_CLK = (F_DMIC_MCLK)/(1 + DMCLKDIV)
     * |        |          |where F_DMIC_MCLK is the frequency of DMIC working main clock (DMIC_MCLK) and F_DMIC_CLK is the frequency of DMIC bus clock (DMIC_CLK).
     * |[20:16] |DMTH      |FIFO Threshold Level
     * |        |          |If the valid data count of the FIFO data buffer is more than or equal to DMTH (DMIC_DIV[20:16]) setting, the DMTHIF (DMIC_STATUS[2]) bit will set to 1, else the DMTHIF (DMIC_STATUS[2]) bit will be cleared to 0.
     * |[21]    |DMTHIE    |FIFO Threshold Interrupt
     * |        |          |0 = FIFO threshold interrupt Disabled
     * |        |          |1 = FIFO threshold interrupt Enabled.
     * |[23:22] |FCLR      |FIFO Clear
     * |        |          |11 = Clear the FIFO.
     * |        |          |Others = Reserved. Do not use.
     * |        |          |Note 1: To clear the FIFO, need to write FCLR (DMIC_DIV[23:22]) to 11b, and can read the EMPTY (DMIC_STATUS[1]) bit to make sure that the FIFO has been cleared.
     * |        |          |Note 2: This field is auto cleared by hardware.
     * |[27:24] |OSR       |DMIC OSR Setting
     * |        |          |000 = Down sample 64
     * |        |          |001 = Down sample 128
     * |        |          |010 = Down sample 256
     * |        |          |011 = Down sample 100
     * |        |          |111 = Down sample 50
     * @var DMIC_T::STATUS
     * Offset: 0x08  DMIC Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FULL      |FIFO Full Indicator (Read Only)
     * |        |          |0 = FIFO is not full.
     * |        |          |1 = FIFO is full.
     * |[1]     |EMPTY     |FIFO Empty Indicator (Read Only)
     * |        |          |0 = FIFO is not empty.
     * |        |          |1 = FIFO is empty.
     * |[2]     |DMTHIF    |FIFO Threshold Interrupt Status (Read Only)
     * |        |          |0 = The valid data count within the FIFO data buffer is less than the setting value of DMTH (DMIC_DIV[20:16]).
     * |        |          |1 = The valid data count within the FIFO data buffer is more than or equal to the setting value of TH (DMIC_DIV[20:16])
     * |[8:4]   |FIFOPTR   |FIFO Pointer (Read Only)
     * |        |          |The FULL (DMIC_STATUS[0]) and FIFOPTR (DMIC_STATUS[8:4]) indicates the field that the valid data count within the DMIC FIFO buffer.
     * |        |          |The maximum value shown in FIFOPTR (DMIC_STATUS[8:4]) is 31
     * |        |          |When the using level of DMIC FIFO buffer equal to 32, The FULL (DMIC_STATUS[0]) is set to 1.
     * @var DMIC_T::LPPDMACTL
     * Offset: 0x0C  DMIC LPPDMA Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LPPDMAEN  |LPPDMA Transfer Enable Bit
     * |        |          |0 = LPPDMA data transfer Disabled.
     * |        |          |1 = LPPDMA data transfer Enabled.
     * @var DMIC_T::FIFO
     * Offset: 0x10  DMIC FIFO Data Output Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |FIFO      |FIFO Data Output Register
     * |        |          |DMIC contains 32 level (32x24 bit) data buffer for data receive
     * |        |          |A read to this register pushes data out from FIFO data buffer and decrements the read pointer
     * |        |          |This is the address that PDMA reads audio data from
     * |        |          |The remaining data word number is indicated by FIFOPTR (DMIC_STATUS[8:4]).
     * @var DMIC_T::GAINCTL0
     * Offset: 0x14  DMIC Channel 0 and 1 Volume Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CHyyVOL   |Channel even volume/gain control, 0.125dB step
     * |        |          |A 16-bit signed 2u2019s complement number, format is as following
     * |        |          |[15]Sign
     * |        |          |[14:7]Integer Part
     * |        |          |[6]1/2 dB
     * |        |          |[5]1/4 dB
     * |        |          |[4]1/8 dB
     * |        |          |[3]1/16dB
     * |        |          |[2:0]Reserved
     * |        |          |The mapping between real gain and programmed number is
     * |        |          |CHxVOL= -128-(Real_Gain) (dB)
     * |        |          |For example,
     * |        |          |if the desired gain is 0dB, the program value will be -128 (0xC000)
     * |        |          |if the desired gain is -20.5dB, then the programmed value will be -107.5(0xCA40)
     * |[31:16] |CHxxVOL   |Channel odd volume/gain control, 0.125dB step
     * |        |          |A 16-bit signed 2u2019s complement number, format is as following
     * |        |          |[31]Sign
     * |        |          |[30:23]Integer Part
     * |        |          |[22]1/2 dB
     * |        |          |[21]1/4 dB
     * |        |          |[20]1/8 dB
     * |        |          |[19]1/16dB
     * |        |          |[18:16]Reserved
     * |        |          |The mapping between real gain and programmed number is
     * |        |          |CHxVOL= -128-(Real_Gain) (dB)
     * |        |          |For example,
     * |        |          |if the desired gain is 0dB, the program value will be -128 (0xC000)
     * |        |          |if the desired gain is -20.5dB, then the programmed value will be -107.5(0xCA40)
     * @var DMIC_T::GAINCTL1
     * Offset: 0x18  DMIC Channel 2 and 3 Volume Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CHyyVOL   |Channel yy volume/gain control, 0.125dB step
     * |        |          |A 16-bit signed 2u2019s complement number, format is as following
     * |        |          |[15]Sign
     * |        |          |[14:7]Integer Part
     * |        |          |[6]1/2 dB
     * |        |          |[5]1/4 dB
     * |        |          |[4]1/8 dB
     * |        |          |[3]1/16dB
     * |        |          |[2:0]Reserved
     * |        |          |The mapping between real gain and programmed number is
     * |        |          |CHxVOL= -128-(Real_Gain) (dB)
     * |        |          |For example,
     * |        |          |if the desired gain is 0dB, the program value will be -128 (0xC000)
     * |        |          |if the desired gain is -20.5dB, then the programmed value will be -107.5(0xCA40)
     * |[31:16] |CHxxVOL   |Channel xx volume/gain control, 0.125dB step
     * |        |          |A 16-bit signed 2u2019s complement number, format is as following
     * |        |          |[31]Sign
     * |        |          |[30:23]Integer Part
     * |        |          |[22]1/2 dB
     * |        |          |[21]1/4 dB
     * |        |          |[20]1/8 dB
     * |        |          |[19]1/16dB
     * |        |          |[18:16]Reserved
     * |        |          |The mapping between real gain and programmed number is
     * |        |          |CHxVOL= -128-(Real_Gain) (dB)
     * |        |          |For example,
     * |        |          |if the desired gain is 0dB, the program value will be -128 (0xC000)
     * |        |          |if the desired gain is -20.5dB, then the programmed value will be -107.5(0xCA40)
     */
    __IO uint32_t CTL;                   /*!< [0x0000] DMIC Control Register                                            */
    __IO uint32_t DIV;                   /*!< [0x0004] DMIC Clock Divider Register                                      */
    __I  uint32_t STATUS;                /*!< [0x0008] DMIC Status Register                                             */
    __IO uint32_t LPPDMACTL;             /*!< [0x000c] DMIC LPPDMA Control Register                                       */
    __I  uint32_t FIFO;                  /*!< [0x0010] DMIC FIFO Data Output Register                                  */
    __IO uint32_t GAINCTL0;              /*!< [0x0014] DMIC Channel 0 and 1 Volume Control Register                     */
    __IO uint32_t GAINCTL1;              /*!< [0x0018] DMIC Channel 2 and 3 Volume Control Register                     */
    __I  uint32_t RESERVE0[6];
} DMIC_T;


typedef struct
{

