zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/dmic_reg.h
} VAD_T;

/**
    @addtogroup DMIC_CONST DMIC Bit Field Definition
    Constant Definitions for DMIC Controller
@{ */


#define DMIC_CTL_CHEN0_Pos               (0)                                               /*!< DMIC_T::CTL: CHEN0 Position            */
#define DMIC_CTL_CHEN0_Msk               (0x1ul << DMIC_CTL_CHEN0_Pos)                     /*!< DMIC_T::CTL: CHEN0 Mask                */

#define DMIC_CTL_CHEN1_Pos               (1)                                               /*!< DMIC_T::CTL: CHEN1 Position            */
#define DMIC_CTL_CHEN1_Msk               (0x1ul << DMIC_CTL_CHEN1_Pos)                     /*!< DMIC_T::CTL: CHEN1 Mask                */

#define DMIC_CTL_CHEN2_Pos               (2)                                               /*!< DMIC_T::CTL: CHEN2 Position            */
#define DMIC_CTL_CHEN2_Msk               (0x1ul << DMIC_CTL_CHEN2_Pos)                     /*!< DMIC_T::CTL: CHEN2 Mask                */

#define DMIC_CTL_CHEN3_Pos               (3)                                               /*!< DMIC_T::CTL: CHEN3 Position            */
#define DMIC_CTL_CHEN3_Msk               (0x1ul << DMIC_CTL_CHEN3_Pos)                     /*!< DMIC_T::CTL: CHEN3 Mask                */

#define DMIC_CTL_LCHEDGE01_Pos           (8)                                               /*!< DMIC_T::CTL: LCHEDGE01 Position        */
#define DMIC_CTL_LCHEDGE01_Msk           (0x1ul << DMIC_CTL_LCHEDGE01_Pos)                 /*!< DMIC_T::CTL: LCHEDGE01 Mask            */

#define DMIC_CTL_LCHEDGE23_Pos           (9)                                               /*!< DMIC_T::CTL: LCHEDGE23 Position        */
#define DMIC_CTL_LCHEDGE23_Msk           (0x1ul << DMIC_CTL_LCHEDGE23_Pos)                 /*!< DMIC_T::CTL: LCHEDGE23 Mask            */

#define DMIC_CTL_CH0MUTE_Pos             (12)                                              /*!< DMIC_T::CTL: CH0MUTE Position          */
#define DMIC_CTL_CH0MUTE_Msk             (0x1ul << DMIC_CTL_CH0MUTE_Pos)                   /*!< DMIC_T::CTL: CH0MUTE Mask              */

#define DMIC_CTL_CH1MUTE_Pos             (13)                                              /*!< DMIC_T::CTL: CH1MUTE Position          */
#define DMIC_CTL_CH1MUTE_Msk             (0x1ul << DMIC_CTL_CH1MUTE_Pos)                   /*!< DMIC_T::CTL: CH1MUTE Mask              */

#define DMIC_CTL_CH2MUTE_Pos             (14)                                              /*!< DMIC_T::CTL: CH2MUTE Position          */
#define DMIC_CTL_CH2MUTE_Msk             (0x1ul << DMIC_CTL_CH2MUTE_Pos)                   /*!< DMIC_T::CTL: CH2MUTE Mask              */

#define DMIC_CTL_CH3MUTE_Pos             (15)                                              /*!< DMIC_T::CTL: CH3MUTE Position          */
#define DMIC_CTL_CH3MUTE_Msk             (0x1ul << DMIC_CTL_CH3MUTE_Pos)                   /*!< DMIC_T::CTL: CH3MUTE Mask              */

#define DMIC_CTL_CH01HPFEN_Pos           (20)                                              /*!< DMIC_T::CTL: CH01HPFEN Position        */
#define DMIC_CTL_CH01HPFEN_Msk           (0x1ul << DMIC_CTL_CH01HPFEN_Pos)                 /*!< DMIC_T::CTL: CH01HPFEN Mask            */

#define DMIC_CTL_CH23HPFEN_Pos           (21)                                              /*!< DMIC_T::CTL: CH23HPFEN Position        */
#define DMIC_CTL_CH23HPFEN_Msk           (0x1ul << DMIC_CTL_CH23HPFEN_Pos)                 /*!< DMIC_T::CTL: CH23HPFEN Mask            */

#define DMIC_CTL_SWRST_Pos               (24)                                              /*!< DMIC_T::CTL: SWRST Position            */
#define DMIC_CTL_SWRST_Msk               (0x1ul << DMIC_CTL_SWRST_Pos)                     /*!< DMIC_T::CTL: SWRST Mask                */

#define DMIC_CTL_GAINSTEP_Pos            (27)                                              /*!< DMIC_T::CTL: GAINSTEP Position         */
#define DMIC_CTL_GAINSTEP_Msk            (0x3ul << DMIC_CTL_GAINSTEP_Pos)                  /*!< DMIC_T::CTL: GAINSTEP Mask             */

#define DMIC_CTL_FIFOWIDTH_Pos           (31)                                              /*!< DMIC_T::CTL: FIFOWIDTH Position        */
#define DMIC_CTL_FIFOWIDTH_Msk           (0x1ul << DMIC_CTL_FIFOWIDTH_Pos)                 /*!< DMIC_T::CTL: FIFOWIDTH Mask            */

#define DMIC_DIV_DMCLKDIV_Pos            (8)                                               /*!< DMIC_T::DIV: DMCLKDIV Position         */
#define DMIC_DIV_DMCLKDIV_Msk            (0x3ful << DMIC_DIV_DMCLKDIV_Pos)                 /*!< DMIC_T::DIV: DMCLKDIV Mask             */

#define DMIC_DIV_DMTH_Pos                (16)                                              /*!< DMIC_T::DIV: DMTH Position             */
#define DMIC_DIV_DMTH_Msk                (0x1ful << DMIC_DIV_DMTH_Pos)                     /*!< DMIC_T::DIV: DMTH Mask                 */

#define DMIC_DIV_DMTHIE_Pos              (21)                                              /*!< DMIC_T::DIV: DMTHIE Position           */
#define DMIC_DIV_DMTHIE_Msk              (0x1ul << DMIC_DIV_DMTHIE_Pos)                    /*!< DMIC_T::DIV: DMTHIE Mask               */

#define DMIC_DIV_FCLR_Pos                (22)                                              /*!< DMIC_T::DIV: FCLR Position             */
#define DMIC_DIV_FCLR_Msk                (0x3ul << DMIC_DIV_FCLR_Pos)                      /*!< DMIC_T::DIV: FCLR Mask                 */

#define DMIC_DIV_OSR_Pos                 (24)                                              /*!< DMIC_T::DIV: OSR Position              */
#define DMIC_DIV_OSR_Msk                 (0x7ul << DMIC_DIV_OSR_Pos)                       /*!< DMIC_T::DIV: OSR Mask                  */

#define DMIC_STATUS_FULL_Pos             (0)                                               /*!< DMIC_T::STATUS: FULL Position          */
#define DMIC_STATUS_FULL_Msk             (0x1ul << DMIC_STATUS_FULL_Pos)                   /*!< DMIC_T::STATUS: FULL Mask              */

#define DMIC_STATUS_EMPTY_Pos            (1)                                               /*!< DMIC_T::STATUS: EMPTY Position         */
#define DMIC_STATUS_EMPTY_Msk            (0x1ul << DMIC_STATUS_EMPTY_Pos)                  /*!< DMIC_T::STATUS: EMPTY Mask             */

#define DMIC_STATUS_DMTHIF_Pos           (2)                                               /*!< DMIC_T::STATUS: DMTHIF Position        */
#define DMIC_STATUS_DMTHIF_Msk           (0x1ul << DMIC_STATUS_DMTHIF_Pos)                 /*!< DMIC_T::STATUS: DMTHIF Mask            */

#define DMIC_STATUS_FIFOPTR_Pos          (4)                                               /*!< DMIC_T::STATUS: FIFOPTR Position       */
#define DMIC_STATUS_FIFOPTR_Msk          (0x1ful << DMIC_STATUS_FIFOPTR_Pos)               /*!< DMIC_T::STATUS: FIFOPTR Mask           */

#define DMIC_LPPDMACTL_LPPDMAEN_Pos          (0)                                               /*!< DMIC_T::LPPDMACTL: LPPDMAEN Position       */
#define DMIC_LPPDMACTL_LPPDMAEN_Msk          (0x1ul << DMIC_LPPDMACTL_LPPDMAEN_Pos)                /*!< DMIC_T::LPPDMACTL: LPPDMAEN Mask           */

#define DMIC_FIFO_FIFO_Pos               (0)                                               /*!< DMIC_T::FIFO: FIFO Position            */
#define DMIC_FIFO_FIFO_Msk               (0xfffffful << DMIC_FIFO_FIFO_Pos)              /*!< DMIC_T::FIFO: FIFO Mask                */

#define DMIC_GAINCTL0_CHyyLVOL_Pos        (0)                                               /*!< DMIC_T::GAINCTL0: CHyyLVOL Position     */
#define DMIC_GAINCTL0_CHyyLVOL_Msk        (0xfffful << DMIC_GAINCTL0_CHyyLVOL_Pos)           /*!< DMIC_T::GAINCTL0: CHyyLVOL Mask         */

#define DMIC_GAINCTL0_CHxxRVOL_Pos        (16)                                              /*!< DMIC_T::GAINCTL0: CHxxRVOL Position     */
#define DMIC_GAINCTL0_CHxxRVOL_Msk        (0xfffful << DMIC_GAINCTL0_CHxxRVOL_Pos)           /*!< DMIC_T::GAINCTL0: CHxxRVOL Mask         */

#define DMIC_GAINCTL1_CHyyLVOL_Pos        (0)                                               /*!< DMIC_T::GAINCTL1: CHyyLVOL Position     */
#define DMIC_GAINCTL1_CHyyLVOL_Msk        (0xfffful << DMIC_GAINCTL1_CHyyLVOL_Pos)           /*!< DMIC_T::GAINCTL1: CHyyLVOL Mask         */

