zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/dmic_reg.h
#define DMIC_GAINCTL1_CHxxRVOL_Pos        (16)                                              /*!< DMIC_T::GAINCTL1: CHxxRVOL Position     */
#define DMIC_GAINCTL1_CHxxRVOL_Msk        (0xfffful << DMIC_GAINCTL1_CHxxRVOL_Pos)           /*!< DMIC_T::GAINCTL1: CHxxRVOL Mask         */

#define VAD_SINCCTL_SINCOSR_Pos          (8)                                               /*!< VAD_T::SINCCTL: SINCOSR Position       */
#define VAD_SINCCTL_SINCOSR_Msk          (0xful << VAD_SINCCTL_SINCOSR_Pos)                /*!< VAD_T::SINCCTL: SINCOSR Mask           */

#define VAD_SINCCTL_VADMCLKDIV_Pos       (16)                                              /*!< VAD_T::SINCCTL: VADMCLKDIV Position      */
#define VAD_SINCCTL_VADMCLKDIV_Msk       (0xfful << VAD_SINCCTL_VADMCLKDIV_Pos)               /*!< VAD_T::SINCCTL: VADMCLKDIV Mask          */

#define VAD_SINCCTL_ACTCL_Pos            (30)                                              /*!< VAD_T::SINCCTL: ACTCL Position         */
#define VAD_SINCCTL_ACTCL_Msk            (0x1ul << VAD_SINCCTL_ACTCL_Pos)                  /*!< VAD_T::SINCCTL: ACTCL Mask             */

#define VAD_SINCCTL_VADEN_Pos            (31)                                              /*!< VAD_T::SINCCTL: VADEN Position         */
#define VAD_SINCCTL_VADEN_Msk            (0x1ul << VAD_SINCCTL_VADEN_Pos)                  /*!< VAD_T::SINCCTL: VADEN Mask             */

#define VAD_BIQCTL0_BIQA1_Pos            (0)                                               /*!< VAD_T::BIQCTL0: BIQA1 Position         */
#define VAD_BIQCTL0_BIQA1_Msk            (0xfffful << VAD_BIQCTL0_BIQA1_Pos)               /*!< VAD_T::BIQCTL0: BIQA1 Mask             */

#define VAD_BIQCTL0_BIQA2_Pos            (16)                                              /*!< VAD_T::BIQCTL0: BIQA2 Position         */
#define VAD_BIQCTL0_BIQA2_Msk            (0xfffful << VAD_BIQCTL0_BIQA2_Pos)               /*!< VAD_T::BIQCTL0: BIQA2 Mask             */

#define VAD_BIQCTL1_BIQB0_Pos            (0)                                               /*!< VAD_T::BIQCTL1: BIQB0 Position         */
#define VAD_BIQCTL1_BIQB0_Msk            (0xfffful << VAD_BIQCTL1_BIQB0_Pos)               /*!< VAD_T::BIQCTL1: BIQB0 Mask             */

#define VAD_BIQCTL1_BIQB1_Pos            (16)                                              /*!< VAD_T::BIQCTL1: BIQB1 Position         */
#define VAD_BIQCTL1_BIQB1_Msk            (0xfffful << VAD_BIQCTL1_BIQB1_Pos)               /*!< VAD_T::BIQCTL1: BIQB1 Mask             */

#define VAD_BIQCTL2_BIQB2_Pos            (0)                                               /*!< VAD_T::BIQCTL2: BIQB2 Position         */
#define VAD_BIQCTL2_BIQB2_Msk            (0xfffful << VAD_BIQCTL2_BIQB2_Pos)               /*!< VAD_T::BIQCTL2: BIQB2 Mask             */

#define VAD_BIQCTL2_BIQEN_Pos            (31)                                              /*!< VAD_T::BIQCTL2: BIQEN Position         */
#define VAD_BIQCTL2_BIQEN_Msk            (0x1ul << VAD_BIQCTL2_BIQEN_Pos)                  /*!< VAD_T::BIQCTL2: BIQEN Mask             */

#define VAD_CTL0_STAT_Pos                (0)                                               /*!< VAD_T::CTL0: STAT Position             */
#define VAD_CTL0_STAT_Msk                (0xfful << VAD_CTL0_STAT_Pos)                     /*!< VAD_T::CTL0: STAT Mask                 */

#define VAD_CTL0_LTAT_Pos                (16)                                              /*!< VAD_T::CTL0: LTAT Position             */
#define VAD_CTL0_LTAT_Msk                (0xful << VAD_CTL0_LTAT_Pos)                      /*!< VAD_T::CTL0: LTAT Mask                 */

#define VAD_CTL1_STTHREHWM_Pos           (0)                                               /*!< VAD_T::CTL1: STTHREHWM Position        */
#define VAD_CTL1_STTHREHWM_Msk           (0xfffful << VAD_CTL1_STTHREHWM_Pos)              /*!< VAD_T::CTL1: STTHREHWM Mask            */

#define VAD_CTL2_LTTHRE_Pos              (16)                                              /*!< VAD_T::CTL2: LTTHRE Position           */
#define VAD_CTL2_LTTHRE_Msk              (0xfffful << VAD_CTL2_LTTHRE_Pos)                 /*!< VAD_T::CTL2: LTTHRE Mask               */

#define VAD_CTL3_DEVTHRE_Pos             (0)                                               /*!< VAD_T::CTL3: DEVTHRE Position          */
#define VAD_CTL3_DEVTHRE_Msk             (0xfffful << VAD_CTL3_DEVTHRE_Pos)                /*!< VAD_T::CTL3: DEVTHRE Mask              */

#define VAD_STATUS0_STP_Pos              (0)                                               /*!< VAD_T::STATUS0: STP Position           */
#define VAD_STATUS0_STP_Msk              (0xfffful << VAD_STATUS0_STP_Pos)                 /*!< VAD_T::STATUS0: STP Mask               */

#define VAD_STATUS0_ACTIVE_Pos           (31)                                              /*!< VAD_T::STATUS0: ACTIVE Position        */
#define VAD_STATUS0_ACTIVE_Msk           (0x1ul << VAD_STATUS0_ACTIVE_Pos)                 /*!< VAD_T::STATUS0: ACTIVE Mask            */

#define VAD_STATUS1_DEV_Pos              (0)                                               /*!< VAD_T::STATUS1: DEV Position           */
#define VAD_STATUS1_DEV_Msk              (0xfffful << VAD_STATUS1_DEV_Pos)                 /*!< VAD_T::STATUS1: DEV Mask               */

#define VAD_STATUS1_LTP_Pos              (16)                                              /*!< VAD_T::STATUS1: LTP Position           */
#define VAD_STATUS1_LTP_Msk              (0xfffful << VAD_STATUS1_LTP_Pos)                 /*!< VAD_T::STATUS1: LTP Mask               */

/** @} DMIC_CONST */
/** @} end of DMIC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __DMIC_REG_H__ */
